In [40]:
#series object in one dimensional labeled array
import pandas as pd

In [41]:
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [42]:
type(s1)

pandas.core.series.Series

In [43]:
#changing index
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [44]:
#series object from dictionary
pd.Series({'s':5,'p':6,'d':7})

s    5
p    6
d    7
dtype: int64

In [45]:
#changing index
s1=pd.Series({'s':5,'p':6,'d':7},index=['d','s','p','f'])
s1

d    7.0
s    5.0
p    6.0
f    NaN
dtype: float64

In [46]:
#extracting a single of elements
l1=[1,4,3,2,6,7,7,9,]
s1=pd.Series(l1)
s1

0    1
1    4
2    3
3    2
4    6
5    7
6    7
7    9
dtype: int64

In [47]:
s1[5]

7

In [48]:
s1[:7]

0    1
1    4
2    3
3    2
4    6
5    7
6    7
dtype: int64

In [49]:
#basic math operation on series

In [50]:
s1

0    1
1    4
2    3
3    2
4    6
5    7
6    7
7    9
dtype: int64

In [51]:
#adding a scalar value to series elements
s1+4

0     5
1     8
2     7
3     6
4    10
5    11
6    11
7    13
dtype: int64

In [52]:
#adding two series objects
s2=pd.Series([5,10,15,20,25,30,40,45])
s1+s2

0     6
1    14
2    18
3    22
4    31
5    37
6    47
7    54
dtype: int64

In [53]:
#creating data frame 
pd.DataFrame({'Name':['Ram','Sam','Hari'],'Marks':[45,32,65]})

   Name  Marks
0   Ram     45
1   Sam     32
2  Hari     65

In [54]:
#printing first five records
rast=pd.read_csv('/Users/apekshagyawali/Downloads/seattle-weather.csv')
rast.head()

         date  precipitation  temp_max  temp_min  wind  weather
0  2012-01-01            0.0      12.8       5.0   4.7  drizzle
1  2012-01-02           10.9      10.6       2.8   4.5     rain
2  2012-01-03            0.8      11.7       7.2   2.3     rain
3  2012-01-04           20.3      12.2       5.6   4.7     rain
4  2012-01-05            1.3       8.9       2.8   6.1     rain

In [55]:
#printing last five records
rast.tail()

            date  precipitation  temp_max  temp_min  wind weather
1456  2015-12-27            8.6       4.4       1.7   2.9    rain
1457  2015-12-28            1.5       5.0       1.7   1.3    rain
1458  2015-12-29            0.0       7.2       0.6   2.6     fog
1459  2015-12-30            0.0       5.6      -1.0   3.4     sun
1460  2015-12-31            0.0       5.6      -2.1   3.5     sun